       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDSAMPLE.
       ENVIRONMENT DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'Hello, world!'.
           STOP RUN.
